{
  "entry": "Hi!",
  "headerAboutMe": "  I am a Frontend Developer",
  "headerText": "Currently Freelancing for UX, UI, & Web Design Project. Invite me to join your team ",
  "skillsTitle": "Skills",
  "profileTitle": "Profile",
  "basicInfo": "Basic Information",
  "projectTitle": "PROJECTS",
  "dateOfBirthTitle": "Date Of Birth",
  "residenceTitle": "Residance",
  "educationTitle": "Education",
  "preferredRoleTitle": "Preferred Role",
  "aboutMeTitle": "About me",
  "footerText": "Send me a message!",
  "footerAltText": "Got a question or proposal, or just wantto say hello? Go ahead.",
  "github": "View on Github",
  "goApp": "Go to App",
  "email": "aliyzbsi68@hotmail.com",
  "cv": "Resume",
  "projects": [
    {
      "id": 1,
      "name": "Teknolojik Pizza",
      "description": "The 'Teknolojik Pizza' website was created to provide a thematic experience focused on the digitalization of the food industry, specifically for pizza ordering or delivery simulation. Designed to help users better understand the online food ordering process, the site incorporates an interactive structure to enhance user engagement.",
      "url": "https://teknolojik-pizza.vercel.app",
      "githubUrl": "https://github.com/aliyzbsi/teknolojik-pizza",
      "dateCreated": "2024-10-12",
      "technologies": [
        "React",
        "Cypress",
        "Tailwind",
        "Vercel",
        "Axios",
        "Toastify",
        "Router"
      ]
    },
    {
      "id": 2,
      "name": "WORKINTECH COMMERCE",
      "description": " The website 'WORKINTECH COMMERCE' serves as a practical demonstration of an e-commerce platform, showcasing various functionalities such as product listings, a shopping cart, and order management. It is designed for educational purposes, allowing users to understand how e-commerce applications function. The site is built using modern web technologies, including React for the frontend and Vite for development. For further details, you can visit the site directly",
      "url": "https://ecommerceformypractice.vercel.app/",
      "githubUrl": "https://github.com/aliyzbsi/E-commerce-for-begin",
      "dateCreated": "2024-11-04",
      "technologies": [
        "React",
        "Vercel",
        "React Hook Form",
        "Axios",
        "Tailwind",
        "Tanstack",
        "Router",
        "Toastify"
      ]
    },
    {
      "id": 3,
      "name": "To-Do App",
      "description": " The website 'alinintodolisti' provides a simple and functional to-do list experience for users to organize their tasks. Such applications allow users to organize their tasks, mark them as completed, and track their progress.",
      "url": "https://alinintodolisti.vercel.app",
      "githubUrl": "https://github.com/aliyzbsi/ToDoApp",
      "dateCreated": "2023-11-03",
      "technologies": [
        "React",

        "React Hook Form",
        "Router",
        "Toastify",

        "Vercel"
      ]
    },
    {
      "id": 4,
      "name": "Ali Yüzbaşı Portfolio",
      "description": "The platform is designed to showcase the developer's skills and projects. It provides users with a detailed presentation of the developer's projects, technical abilities, and experiences, allowing potential employers and clients to effectively get to know the developer.",
      "url": "https://example.com/proje2",
      "githubUrl": "https://github.com/aliyzbsi/movieDB-with-Redux",
      "dateCreated": "2024-11-04",
      "technologies": ["React", "Tailwind", "Vercel"]
    },
    {
      "id": 5,
      "name": "MovieDB",
      "description": "The site is a platform that allows users to explore and manage movie data. It aims to enhance user experience by offering functions such as searching, listing, and accessing detailed information about films. The developer has utilized modern web technologies like React and Redux to create a dynamic and interactive interface. The application retrieves updated content via an API. For more information, you can visit the site.",
      "url": "https://moviedb-redux.onrender.com",
      "githubUrl": "https://github.com/aliyzbsi/movieDB-with-Redux",
      "dateCreated": "2023-01-01",
      "technologies": ["React", "Render", "Redux", "Axios", "Router"]
    }
  ],
  "skills": ["Javascript", "react", "redux", "node", "vs code", "figma"],
  "personelInfo": [
    {
      "dateOfBirth": "20/09/1999",
      "residenceAdr": "Aksaray",
      "preferredRole": ["Frontend", "UI", "Backend"],
      "education": "Firat University, Software Engineering, Bachelor Degree, 2022",
      "aboutMe": "I was born on January 20, 1999, in Ortaköy, Aksaray, where I spent the early years of my education. I completed my undergraduate studies in Software Engineering at Fırat University, graduating in 2022 with a GPA of 2.76. Throughout my studies, I explored different programming languages, developed projects, and gained experience through internships. After graduation, I fulfilled my military service at the MSU Information Technology Department, serving as the Testing and Evaluation Supervisor. Now, I am focused on advancing my career in software development by learning new technologies."
    }
  ]
}
