{
  "entry": "Merhaba!",
  "thirdDesignEntry": "Yaratıcı düşünür Minimalizm aşığı",
  "thirdDesignHeaderAboutMe": "Merhaba ben Ali. Ben tam kapsamlı bir geliştiriciyim. Mükemmel kullanıcı deneyimleriyle sağlam ve ölçeklenebilir ön uç ürünleri üretecek bir Geliştirici arıyorsanız. Benimle birlikte çalışmak ister misiniz ?",
  "headerAboutMe": "Ben Ali. Ben bir full-stack geliştiricisiyim. Sağlam ve ölçeklenebilir frontend ürünleri oluşturabilirim. Tanışalım!",
  "secondHeaderAboutMe": "Ben bir Frontend Geliştiriciyim",

  "headerText": "Şu anda UX, UI ve Web Tasarım projeleri için serbest çalışıyorum. Beni ekibinize davet edin ",
  "secondHeaderText": "Harika kullanıcı deneyimlerine sahip, sağlam ve ölçeklenebilir ön uç ürünler oluşturmayı seven.",
  "skillsTitle": "YETENEKLER",
  "profileTitle": "PROFİL",
  "basicInfo": "Temel Bilgiler",
  "projectTitle": "PROJELER",
  "dateOfBirthTitle": "Doğum Tarihi",
  "residenceTitle": "İkamet",
  "educationTitle": "Eğitim",
  "preferredRoleTitle": "Tercih Edilen Rol",
  "aboutMeTitle": "Hakkımda",
  "footerText": "Bir sonraki ürününüz üzerinde birlikte çalışalım.",
  "footerAltText": "Bir sorum veya önerim var ya da sadece merhaba demek için mi? Devam et.",
  "github": "GitHub'da Görüntüle",
  "goApp": "Uygulamaya Git",
  "email": "aliyzbsi68@hotmail.com",
  "cv": "Özgeçmiş",

  "projects": [
    {
      "id": 1,
      "name": "Teknolojik Pizza",
      "description": "Teknolojik Pizza adlı web sitesi, dijitalleşen gıda sektörüne yönelik olarak pizza siparişi simülasyonu veya pizza teslimat süreci gibi tematik bir deneyim sunmak amacıyla yapılmıştır. Kullanıcıların online yemek sipariş süreçlerini daha iyi anlamaları için hazırlananan sitede kullanıcı etkileşimi sağlamak adına interaktif bir yapı sağlanmıştır.",
      "url": "https://teknolojik-pizza.vercel.app/",
      "githubUrl": "https://github.com/aliyzbsi/teknolojik-pizza",
      "dateCreated": "2024-10-12",
      "technologies": [
        "React",
        "Cypress",
        "Tailwind",
        "Vercel",
        "Axios",
        "Toastify",
        "Router"
      ]
    },
    {
      "id": 2,
      "name": "WORKINTECH COMMERCE",
      "description": " 'WORKINTECH COMMERCE' web sitesi, e-ticaret uygulamalarının işleyişini göstermek amacıyla oluşturulmuş bir platformdur. Kullanıcılara ürün listeleme, alışveriş sepeti ve sipariş yönetimi gibi işlevler sunarak eğitici bir deneyim sağlamaktadır. Frontend kısmı için React ve geliştirme ortamı olarak Vite kullanılmıştır. Daha fazla bilgi için siteyi ziyaret edebilirsiniz",
      "url": "https://ecommerceformypractice.vercel.app/",
      "githubUrl": "https://github.com/aliyzbsi/E-commerce-for-begin",
      "dateCreated": "2024-11-04",
      "technologies": [
        "React",
        "Vercel",
        "React Hook Form",
        "Axios",
        "Tailwind",
        "Tanstack",
        "Router",
        "Toastify"
      ]
    },
    {
      "id": 3,
      "name": "To-Do App",
      "description": " 'alinintodolisti' adlı web sitesi, kullanıcıların görevlerini organize etmeleri için basit ve işlevsel bir yapılacaklar listesi oluşturma deneyimi sunmaktadır. Bu tür uygulamalar, kullanıcıların yapılacak görevleri düzenlemelerine, tamamladıklarında işaretlemelerine ve ilerlemelerini görmelerine olanak tanır.",
      "url": "https://alinintodolisti.vercel.app",
      "githubUrl": "https://github.com/aliyzbsi/ToDoApp",
      "dateCreated": "2023-11-03",
      "technologies": [
        "React",

        "React Hook Form",
        "Router",
        "Toastify",

        "Vercel"
      ]
    },
    {
      "id": 4,
      "name": "Ali Yüzbaşı Portfolio",
      "description": "Geliştiricinin yeteneklerini ve projelerini sergilemek amacıyla oluşturulmuş bir platformdur. Kullanıcılara, yazılımcının yaptığı projeleri, teknik becerilerini ve deneyimlerini detaylı bir şekilde sunarak, potansiyel işverenlere ve müşterilere etkili bir şekilde kendini tanıtma fırsatı sağlar.",
      "url": "https://example.com/proje1",
      "githubUrl": "https://github.com/aliyzbsi/movieDB-with-Redux",
      "dateCreated": "2023-11-04",
      "technologies": ["React", "Tailwind", "Vercel"]
    },
    {
      "id": 5,
      "name": "MovieDB",
      "description": "Site, kullanıcıların film verilerini keşfetmesine ve yönetmesine olanak tanıyan bir platformdur. Filmleri arama, listeleme ve detaylarına erişim gibi işlevler sunarak kullanıcı deneyimini artırmayı hedefler. Geliştirici, React ve Redux gibi modern web teknolojilerini kullanarak dinamik ve etkileşimli bir arayüz oluşturmuştur. Uygulama, bir API üzerinden film verilerini çekerek güncel içerik sağlar. Daha fazla bilgi için siteyi ziyaret edebilirsiniz.",
      "url": "https://moviedb-redux.onrender.com",
      "githubUrl": "https://github.com/aliyzbsi/movieDB-with-Redux",
      "dateCreated": "2024-11-01",
      "technologies": ["React", "Render", "Redux", "Axios", "Router"]
    }
  ],

  "personelInfo": [
    {
      "dateOfBirth": "20/09/1999",
      "residenceAdr": "Aksaray",
      "preferredRole": ["Frontend", "UI", "Backend"],
      "education": "Fırat Üniversitesi, Yazılım Mühendisliği, Lisans Diploması, 2022",
      "aboutMe": "20 Ocak 1999’da Aksaray/Ortaköy’de doğdum ve eğitim hayatımın ilk yıllarını burada geçirdim. Lisans eğitimimi Fırat Üniversitesi Yazılım Mühendisliği bölümünde tamamladım ve 2022’de 2.76 ortalama ile mezun oldum. Eğitim sürecimde farklı yazılım dilleri üzerinde araştırmalar yaparak, projeler geliştirerek ve stajlar yaparak kendimi geliştirme fırsatı buldum. Mezuniyetin ardından, MSÜ Bilgi İşlem Daire Başkanlığı SOME Şubesi’nde Test ve Değerlendirme Kısım Amiri olarak askerlik görevimi tamamladım. Şimdi ise yazılım alanında yeni teknolojiler öğrenerek kariyerimi ileriye taşımayı hedefliyorum.   "
    }
  ]
}
